1s/ERP/Conf/Documents/Лико_ВыполненныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ВыполненныеРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ВыполненныеРаботы</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказуДляОтгрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗатратыПоЗаказу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЦеныГруппНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЦеныГруппНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотериНаРезке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экосбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_РегистраторыЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРасчетЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаНормативов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Флексо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офсет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глубокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бессольвент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Траф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цифровая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЕвро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табаш</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабашФакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ВыполненныеРаботы/Ext/ManagerModule.bsl
#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	
	Возврат ИсточникиДанных; 
	
КонецФункции
 
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ВыполненныеРаботы.Дата КАК Период,
	|	Лико_ВыполненныеРаботы.Номер КАК Номер,
	|	Лико_ВыполненныеРаботы.Организация КАК Организация,
	|	Лико_ВыполненныеРаботы.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.Лико_ВыполненныеРаботы КАК Лико_ВыполненныеРаботы
	|ГДЕ
	|	Лико_ВыполненныеРаботы.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	
	Запрос.УстановитьПараметр("Период",      				Реквизиты.Период);
	Запрос.УстановитьПараметр("ЗаказКлиента", 				Реквизиты.ЗаказКлиента);
	Запрос.УстановитьПараметр("Организация",    			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Ссылка",    					ДокументСсылка);

	
	
	
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаЛико_ВыполненныеРаботы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ВыполненныеРаботы";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	ТекстЗапроса = 
	//Выполнено - Приходуем всю таблицу размещения
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.Организация КАК Организация,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.Сотрудник КАК Сотрудник,
	|	Лико_ВыполненныеРаботыРаботы.Работа КАК Работа,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Лико_ВыполненныеРаботыРаботы.Ссылка.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	1 КАК Количество
	|ИЗ
	|	Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
	|ГДЕ
	|	Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции


//Начало изменений 


Функция ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ЗатратыПоЗаказу";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТПрокатыТрафарета.Период КАК Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр КАК РабочийЦентр,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки)) КАК СтатьяЗатрат,
	|	ВТПрокатыТрафарета.Затрата КАК Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1) КАК НомерПроката,
	|	ВТПрокатыТрафарета.Количество КАК Количество,
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100) КАК НомерПрокатаРаботы,
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК СуммаПлан,
	|	ВТПрокатыТрафарета.Количество КАК КоличествоПлан,
	|	СУММА(0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Период КАК Период,
	|		ВТ.ЗаказКлиента КАК ЗаказКлиента,
	|		ВТ.РабочийЦентр КАК РабочийЦентр,
	|		ВТ.Затрата КАК Затрата,
	|		ВТ.Количество КАК Количество,
	|		ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(&Период) КАК Период,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки КАК Затрата,
	|			СУММА(1) КАК Количество
	|		ИЗ
	|			Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
	|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаТрафСетки.Заказ
	|		ГДЕ
	|			Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка
	|			И Лико_ВыполненныеРаботыРаботы.Работа = ЗНАЧЕНИЕ(Справочник.Лико_Работы.Засветка)
	|			И Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка ЕСТЬ NULL
	|			И Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка ЕСТЬ NULL
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр,
	|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки) КАК ВТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
	|			ПО ВТ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
	|				И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ.Период,
	|		ВТ.ЗаказКлиента,
	|		ВТ.РабочийЦентр,
	|		ВТ.Количество,
	|		ЗаказКлиентаЦвета.НомерПроката,
	|		ВТ.Затрата) КАК ВТПрокатыТрафарета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ПО ВТПрокатыТрафарета.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
	|			И ВТПрокатыТрафарета.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
	|			И ВТПрокатыТрафарета.РабочийЦентр.ВидРабочегоЦентра = ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|			И ВТПрокатыТрафарета.ЗаказКлиента.Площадка = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
	|					И Площадка.Наименование = "" Ликофлекс"") КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
	|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПрокатыТрафарета.Период,
	|	ВТПрокатыТрафарета.ЗаказКлиента,
	|	ВТПрокатыТрафарета.РабочийЦентр,
	|	ВТПрокатыТрафарета.Количество,
	|	ВТПрокатыТрафарета.Затрата,
	|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1),
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100),
	|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0),
	|	ВТПрокатыТрафарета.Количество
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПрокатаРаботы" ;
	;
	
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции




Функция ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Лико_ЗатратыПоЗаказуДляОтгрузки";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВТПрокатыТрафарета.Период КАК Период,
		|	ВТПрокатыТрафарета.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТПрокатыТрафарета.РабочийЦентр КАК РабочийЦентр,
		|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.Лико_СтатьиЗатрат.ТрафаретныеЗасветки)) КАК СтатьяЗатрат,
		|	ВТПрокатыТрафарета.Затрата КАК Затрата,
		|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1) КАК НомерПроката,
		|	ВТПрокатыТрафарета.Количество КАК Количество,
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100) КАК НомерПрокатаРаботы,
		|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ.Период КАК Период,
		|		ВТ.ЗаказКлиента КАК ЗаказКлиента,
		|		ВТ.РабочийЦентр КАК РабочийЦентр,
		|		ВТ.Затрата КАК Затрата,
		|		ВТ.Количество КАК Количество,
		|		ЗаказКлиентаЦвета.НомерПроката КАК НомерПроката
		|	ИЗ
		|		(ВЫБРАТЬ
		|			МАКСИМУМ(&Период) КАК Период,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр КАК РабочийЦентр,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки КАК Затрата,
		|			СУММА(1) КАК Количество
		|		ИЗ
		|			Документ.Лико_ВыполненныеРаботы.Работы КАК Лико_ВыполненныеРаботыРаботы
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ЗасветкаStork КАК Лико_ОтчетФормногоУчасткаЗасветкаStork
		|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаЗасветкаStork.Заказ
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ОтчетФормногоУчастка.ТрафСетки КАК Лико_ОтчетФормногоУчасткаТрафСетки
		|				ПО Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента = Лико_ОтчетФормногоУчасткаТрафСетки.Заказ
		|		ГДЕ
		|			Лико_ВыполненныеРаботыРаботы.Ссылка = &Ссылка
		|			И Лико_ВыполненныеРаботыРаботы.Работа = ЗНАЧЕНИЕ(Справочник.Лико_Работы.Засветка)
		|			И Лико_ОтчетФормногоУчасткаЗасветкаStork.Ссылка ЕСТЬ NULL
		|			И Лико_ОтчетФормногоУчасткаТрафСетки.Ссылка ЕСТЬ NULL
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ЗаказКлиента,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.РабочийЦентр,
		|			Лико_ВыполненныеРаботыРаботы.Ссылка.ТипСетки) КАК ВТ
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|			ПО ВТ.ЗаказКлиента = ЗаказКлиентаЦвета.Ссылка
		|				И (ЗаказКлиентаЦвета.ВидПечати = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыПечати.Траф))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ.Период,
		|		ВТ.ЗаказКлиента,
		|		ВТ.РабочийЦентр,
		|		ВТ.Количество,
		|		ЗаказКлиентаЦвета.НомерПроката,
		|		ВТ.Затрата) КАК ВТПрокатыТрафарета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|		ПО ВТПрокатыТрафарета.ЗаказКлиента = ЗаказКлиентаВидыРабот.Ссылка
		|			И ВТПрокатыТрафарета.НомерПроката = ЗаказКлиентаВидыРабот.НомерПроката
		|			И ВТПрокатыТрафарета.РабочийЦентр.ВидРабочегоЦентра = ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(, ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
		|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
		|			И ВТПрокатыТрафарета.ЗаказКлиента.Площадка = Лико_ЦеныГруппНоменклатурыСрезПоследних.Площадка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|				,
		|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.Табаш)
		|					И Площадка.Наименование = "" Ликофлекс"") КАК Лико_ЦеныГруппНоменклатурыСрезПоследних1
		|		ПО ВТПрокатыТрафарета.Затрата = Лико_ЦеныГруппНоменклатурыСрезПоследних1.ЦеноваяГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПрокатыТрафарета.Период,
		|	ВТПрокатыТрафарета.ЗаказКлиента,
		|	ВТПрокатыТрафарета.РабочийЦентр,
		|	ВТПрокатыТрафарета.Количество,
		|	ВТПрокатыТрафарета.Затрата,
		|	ЕСТЬNULL(ВТПрокатыТрафарета.НомерПроката, 1),
		|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.НомерПроката, 100),
		|	ВТПрокатыТрафарета.Количество * ЕСТЬNULL(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, Лико_ЦеныГруппНоменклатурыСрезПоследних1.Цена), 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПрокатаРаботы";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции



#КонецОбласти

#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти



#Область Прочее

#КонецОбласти 


//+ ---> Лико2.5 m.shenderov 30.03.2022
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
    МеханизмыДокумента.Добавить("Лико_Склад");
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  СписокЗначений, Структура - Данные документа для проведения
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаЛико_ВыполненныеРаботы(Запрос, ТекстыЗапроса, Регистры); 
	ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказу(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаЛико_ЗатратыПоЗаказуДляОтгрузки(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции
 
//- <--- Лико2.5 m.shenderov 30.03.2022
